---
kind: method
id: M:Autodesk.Revit.DB.FabricationRodInfo.AttachToStructure
source: html/c89f2ba8-17f2-cbe7-8b13-c40095b0ffa0.htm
---
# Autodesk.Revit.DB.FabricationRodInfo.AttachToStructure Method

Attaches to the nearest structural element.

## Syntax (C#)
```csharp
public void AttachToStructure()
```